insert into Operator (Name, bScan, bTeam, idPersonnel, idDepName)
values 
('Гуряшин Олег', 1, 0, 25, 15),
('Шиян Тимофей', 1, 0, 54, 15),
('Печенин Илья', 1, 0, 43, 15),
('Винокуров Александр', 1, 0, 24, 15),
('Сопов Игорь', 1, 0, 48, 15),
('Федосов Сергей', 1, 0, 1023, 15),
('Кожаров Максим', 1, 0, 30, 15),
('Никонов Леонид', 1, 0, 36, 15),

('Пашкин Вадим', 1, 0, 42, 15),
('Попова Наталья', 1, 0, 44, 15),
('Ротарь Ирина', 1, 0, 45, 15),
('Соловьева Елена', 1, 0, 47, 15),
('Абдувалиев Абдуллахад', 1, 0, 1028, 15),

('Турабоев Боходир', 1, 0, 28, 15),
('Калинкин Дмитрий', 1, 0, 1026, 15),
('Мурзиков Владимир', 1, 0, 35, 15),

('Щекочихина Полина', 1, 0, 55, 15),
('Демченков Сергей', 1, 0, 26, 15),
('Тургунов Олимжон', 1, 0, 49, 15),

('Отаханов Акрамжон', 1, 0, 40, 15),
('Абдулазизов Аюбжон', 1, 0, 49, 15),
('Ахмадалиев Азизбег', 1, 0, 21, 15),

('Шевляков Павел', 1, 0, 53, 15),
('Турсунов Актам', 1, 0, 50, 15)


select *
from Operator
where Name like '%Овчинников С%'
   or Name like '%Четкуев В%'
   or Name like '%Кузнецов%'
   or Name like '%Никонов%'
   or Name like '%Ротарь%'
   or Name like '%Ермилов%'


update Operator set bTeam = 0 

update Operator set bTeam = 1 where ID in (
select ID
from Operator
where Name like '%Овчинников С%'
   or Name like '%Четкуев В%'
   or Name like '%Кузнецов%'
   or Name like '%Никонов%'
   or Name like '%Ротарь%'
   or Name like '%Ермилов%'
   )
